// forked from cx20's "texgen.js を試してみるテスト" http://jsdo.it/cx20/pmnX

var DOT_SIZE = 29;
var X_START_POS = 0;
var Y_START_POS = 0;
// ‥‥‥‥‥‥‥‥‥‥‥‥‥□□□
// ‥‥‥‥‥‥〓〓〓〓〓‥‥□□□
// ‥‥‥‥‥〓〓〓〓〓〓〓〓〓□□
// ‥‥‥‥‥■■■□□■□‥■■■
// ‥‥‥‥■□■□□□■□□■■■
// ‥‥‥‥■□■■□□□■□□□■
// ‥‥‥‥■■□□□□■■■■■‥
// ‥‥‥‥‥‥□□□□□□□■‥‥
// ‥‥■■■■■〓■■■〓■‥‥‥
// ‥■■■■■■■〓■■■〓‥‥■
// □□■■■■■■〓〓〓〓〓‥‥■
// □□□‥〓〓■〓〓□〓〓□〓■■
// ‥□‥■〓〓〓〓〓〓〓〓〓〓■■
// ‥‥■■■〓〓〓〓〓〓〓〓〓■■
// ‥■■■〓〓〓〓〓〓〓‥‥‥‥‥
// ‥■‥‥〓〓〓〓‥‥‥‥‥‥‥‥
var dataSet = [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","肌","肌","肌",
    "無","無","無","無","無","無","赤","赤","赤","赤","赤","無","無","肌","肌","肌",
    "無","無","無","無","無","赤","赤","赤","赤","赤","赤","赤","赤","赤","肌","肌",
    "無","無","無","無","無","茶","茶","茶","肌","肌","茶","肌","無","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","肌","肌","肌","茶","肌","肌","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","茶","肌","肌","肌","茶","肌","肌","肌","赤",
    "無","無","無","無","茶","茶","肌","肌","肌","肌","茶","茶","茶","茶","赤","無",
    "無","無","無","無","無","無","肌","肌","肌","肌","肌","肌","肌","赤","無","無",
    "無","無","赤","赤","赤","赤","赤","青","赤","赤","赤","青","赤","無","無","無",
    "無","赤","赤","赤","赤","赤","赤","赤","青","赤","赤","赤","青","無","無","茶",
    "肌","肌","赤","赤","赤","赤","赤","赤","青","青","青","青","青","無","無","茶",
    "肌","肌","肌","無","青","青","赤","青","青","黄","青","青","黄","青","茶","茶",
    "無","肌","無","茶","青","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","無","茶","茶","茶","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","茶","茶","茶","青","青","青","青","青","青","青","無","無","無","無","無",
    "無","茶","無","無","青","青","青","青","無","無","無","無","無","無","無","無"
];

function getRgbColor( c )
{
    var colorHash = {
        "無":[0x00/0xff, 0x00/0xff, 0x00/0xff],
        "白":[0xff/0xff, 0xff/0xff, 0xff/0xff],
        "肌":[0xff/0xff, 0xcc/0xff, 0xcc/0xff],
        "茶":[0x80/0xff, 0x00/0xff, 0x00/0xff],
        "赤":[0xff/0xff, 0x00/0xff, 0x00/0xff],
        "黄":[0xff/0xff, 0xff/0xff, 0x00/0xff],
        "緑":[0x00/0xff, 0xff/0xff, 0x00/0xff],
        "水":[0x00/0xff, 0xff/0xff, 0xff/0xff],
        "青":[0x00/0xff, 0x00/0xff, 0xff/0xff],
        "紫":[0x80/0xff, 0x00/0xff, 0x80/0xff]
    };
    return colorHash[ c ];
}

var texture = new TG.Texture( 465, 465 );
for ( var i = 0; i < dataSet.length; i++ ) {
	var x = (i % 16) * DOT_SIZE;
	var y = Math.floor(i / 16) * DOT_SIZE;
	var c = getRgbColor(dataSet[i]);
    texture.add( new TG.Rect().position(x, y).size(DOT_SIZE*0.9, DOT_SIZE*0.9).tint( c[0], c[1], c[2] ) );
}
texture = texture.toCanvas();

document.body.appendChild( texture );
