// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト（その３改4）（調整中）" http://jsdo.it/cx20/EB4w
// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト（その３改3）（調整中）" http://jsdo.it/cx20/ULNB
// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト（その３改2）" http://jsdo.it/cx20/CYGM
// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト（その３改）" http://jsdo.it/cx20/CDcF
// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト（その３）（調整中）" http://jsdo.it/cx20/WkzG
// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト（その２）" http://jsdo.it/cx20/E2ug
// forked from cx20's "[WebGL] Three.js glTF Exporter を使ってみるテスト" http://jsdo.it/cx20/E1yA
// forked from cx20's "Three.js でドット絵を回転するテスト（その３）" http://jsdo.it/cx20/eRDK
// forked from cx20's "Three.js でドット絵を回転するテスト（その１）" http://jsdo.it/cx20/r8Zv
// forked from cx20's "Three.js でドット絵を表示するテスト" http://jsdo.it/cx20/3U7N

import * as THREE from 'three';
import { OrbitControls } from 'three/addons/controls/OrbitControls.js';
import { GLTFExporter } from 'three/addons/exporters/GLTFExporter.js';
import { mergeBufferGeometries } from 'three/addons/utils/BufferGeometryUtils.js';

var DOT_SIZE = 3;
var X_START_POS = -24;
var Y_START_POS = -24;
var Z_START_POS = -12;

// http://kyucon.com/qblock/#/84996
var dataSet = [
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","白","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","茶","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","茶","茶","黒","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","白","白","白","茶","茶","無","無","無",
    "無","白","茶","白","白","白","白","白","白","無","茶","茶","白","白","無","無",
    "白","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","茶","茶","茶","無","無","無",
    "無","無","無","無","無","無","無","無","無","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","黒",
    "無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","無",
    "無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","白","無","無",
    "無","白","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","無","無","無",
    "無","白","茶","茶","茶","茶","茶","茶","白","白","白","茶","白","無","無","無",
    "無","無","白","白","白","白","白","白","白","無","白","白","無","無","無","無",
    "無","無","無","無","無","白","白","白","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","茶","茶","茶","無","無","無",
    "無","無","無","無","無","無","無","無","無","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","黒",
    "無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","無",
    "無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","白","無","無",
    "無","白","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","白","無","無","無",
    "無","白","茶","茶","茶","茶","茶","茶","白","白","白","茶","白","無","無","無",
    "無","無","白","白","白","白","白","白","白","無","白","白","無","無","無","無",
    "無","無","無","無","無","白","白","白","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","茶","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","茶","茶","黒","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","白","白","白","茶","茶","無","無","無",
    "無","白","茶","白","白","白","白","白","白","無","茶","茶","白","白","無","無",
    "白","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","白","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
  [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","茶","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無","無",
    "無","無","茶","茶","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無",
    "無","無","無","茶","茶","茶","茶","茶","茶","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無",
    "無","無","無","無","無","無","無","無","無","無","無","無","無","無","無","無"
  ],
];

function getRgbColor(c) {
  var colorHash = {
    "無": "#DCAA6B", // 段ボール色
    "黒": "#505050",
    "白": "#ffffff",
    "肌": "#ffcccc",
    //"茶": "#800000",
    "茶": "#D8A35F",
    //"赤":"#ff0000",
    "赤": "#AF4357",
    "黄": "#ffff00",
    "緑": "#00ff00",
    "水": "#00ffff",
    "青": "#0000ff",
    //"紫":"#800080"
    "紫": "#70479F"
  };
  return colorHash[c];
}

var width  = window.innerWidth;
var height = window.innerHeight;
var fov    = 80;
var aspect = width / height;
var near   = 1;
var far    = 1000;
var mouseX = 0;
var mouseY = 0;
var windowHalfX = width / 2;
var windowHalfY = height / 2;
var camera;
var renderer;
var theta = 0;
var controls;
var color;

function exportGLTF(input) {
    var gltfExporter = new GLTFExporter();
    var options = {
        binary: document.getElementById('option_binary').checked
    };
    gltfExporter.parse( input, function( result ) {
        if ( result instanceof ArrayBuffer ) {
            saveArrayBuffer( result, 'scene.glb' );
        } else {
            var output = JSON.stringify( result, null, 2 );
            console.log( output );
            saveString( output, 'scene.gltf' );
        }
    }, options );
}

document.getElementById('export_scene').addEventListener('click', function() {

    exportGLTF(scene1);

});


var link = document.createElement('a');
link.style.display = 'none';
document.body.appendChild(link); // Firefox workaround, see #6594

function save( blob, filename ) {
    link.href = URL.createObjectURL( blob );
    link.download = filename;
    link.click();
    // URL.revokeObjectURL( url ); breaks Firefox...
}

function saveString( text, filename ) {
    save( new Blob( [ text ], { type: 'text/plain' } ), filename );
}

function saveArrayBuffer( buffer, filename ) {
    save( new Blob( [ buffer ], { type: 'application/octet-stream' } ), filename );
}

var container;

var scene1, scene2;
var gridHelper, sphere;

init();
animate();

function init() {

    container = document.createElement('div');
    document.body.appendChild(container);

    camera = new THREE.PerspectiveCamera(fov, aspect, near, far);
    camera.position.z = 50;

    scene1 = new THREE.Scene();
    scene1.name = 'Scene1';

    var i, j, x, y, z;
    var meshArray = [];
    var geometryArrayA = [];
    var geometryArrayB = [];
    var geometryArrayC = [];
    var geometryMergeA;
    var geometryMergeB;
    var geometryMergeC;

    for (j = 0; j < dataSet.length; j++) {
        for (i = 0; i < dataSet[j].length; i++) {
            x = (16 - i % 16) * DOT_SIZE + X_START_POS;
            y = (16 - Math.floor(i / 16)) * DOT_SIZE + Y_START_POS;
            z = j * DOT_SIZE + Z_START_POS;
            color = getRgbColor(dataSet[j][i]);
            
            var geometry = new THREE.BoxGeometry(DOT_SIZE * 1, DOT_SIZE * 1, DOT_SIZE * 1)

            geometry.translate(x - 0, y, z);

            // 色別に geometry をマージする
            if (dataSet[j][i] == "茶") {
                geometryArrayA.push(geometry);
            }
            else if (dataSet[j][i] == "白") {
                geometryArrayB.push(geometry);
            }
            else if (dataSet[j][i] == "黒") {
                geometryArrayC.push(geometry);
            }
        }
    }
    geometryMergeA = mergeBufferGeometries(geometryArrayA);
    geometryMergeB = mergeBufferGeometries(geometryArrayB);
    geometryMergeC = mergeBufferGeometries(geometryArrayC);
    geometryMergeA.deleteAttribute( 'normal' ).deleteAttribute( 'uv' );
    geometryMergeB.deleteAttribute( 'normal' ).deleteAttribute( 'uv' );
    geometryMergeC.deleteAttribute( 'normal' ).deleteAttribute( 'uv' );
    
    var materialA = new THREE.MeshStandardMaterial({color: getRgbColor("茶"), roughness: 0.99});
    var meshA = new THREE.Mesh(geometryMergeA, materialA);
    scene1.add(meshA);

    var materialB = new THREE.MeshStandardMaterial({color: getRgbColor("白"), roughness: 0.99});
    var meshB = new THREE.Mesh(geometryMergeB, materialB);
    scene1.add(meshB);

    var materialC = new THREE.MeshStandardMaterial({color: getRgbColor("黒"), roughness: 0.99});
    var meshC = new THREE.Mesh(geometryMergeC, materialC);
    scene1.add(meshC);

    //ライティング
    var light = new THREE.DirectionalLight(0xffffff, 1.0);
    light.position.set(1, 1, 1).normalize();
    scene1.add(light);

    var light2 = new THREE.DirectionalLight(0xffffff);
    light2.position.set(-1, -1, -1).normalize();
    scene1.add(light2);
	
    // 座標軸表示
    var axis = new THREE.AxesHelper(100);
    //scene1.add(axis);

    renderer = new THREE.WebGLRenderer();

    controls = new OrbitControls( camera, renderer.domElement );
    controls.userPan = false;
    controls.userPanSpeed = 0.0;
    controls.maxDistance = 5000.0;
    controls.maxPolarAngle = Math.PI * 0.495;
    controls.autoRotate = true;     //true:自動回転する,false:自動回転しない
    controls.autoRotateSpeed = 10.0;    //自動回転する時の速度


    renderer.setSize(width, height);
    document.body.appendChild(renderer.domElement);
    renderer.render(scene1, camera);

}

function onWindowResize() {

    camera.aspect = window.innerWidth / window.innerHeight;
    camera.updateProjectionMatrix();

    renderer.setSize(window.innerWidth, window.innerHeight);

}

//

function animate() {

    requestAnimationFrame(animate);

    render();

}

function render() {

    var timer = Date.now() * 0.001;

    //camera.position.x = Math.cos(timer) * 50;
    //camera.position.z = Math.sin(timer) * 50;

    //camera.lookAt(scene1.position);
    renderer.render(scene1, camera);

    controls.update();
}