// forked from abebetaro's "四角の描画テスト：徐々に埋めるやつ" http://jsdo.it/abebetaro/testing02
var dx, dy; //縦横のブロックの数
var bsize = 5; //ブロックの大きさ
var wsize = 100; //描画するブロックの数
var initRate = 0.05;
var FPS = 30;
var world = new Array();

var DOT_SIZE = 5;
var X_START_POS = 13;
var Y_START_POS = 13;

// ‥‥‥‥‥‥‥‥‥‥‥‥‥□□□
// ‥‥‥‥‥‥〓〓〓〓〓‥‥□□□
// ‥‥‥‥‥〓〓〓〓〓〓〓〓〓□□
// ‥‥‥‥‥■■■□□■□‥■■■
// ‥‥‥‥■□■□□□■□□■■■
// ‥‥‥‥■□■■□□□■□□□■
// ‥‥‥‥■■□□□□■■■■■‥
// ‥‥‥‥‥‥□□□□□□□■‥‥
// ‥‥■■■■■〓■■■〓■‥‥‥
// ‥■■■■■■■〓■■■〓‥‥■
// □□■■■■■■〓〓〓〓〓‥‥■
// □□□‥〓〓■〓〓□〓〓□〓■■
// ‥□‥■〓〓〓〓〓〓〓〓〓〓■■
// ‥‥■■■〓〓〓〓〓〓〓〓〓■■
// ‥■■■〓〓〓〓〓〓〓‥‥‥‥‥
// ‥■‥‥〓〓〓〓‥‥‥‥‥‥‥‥
var dataSet = [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","肌","肌","肌",
    "無","無","無","無","無","無","赤","赤","赤","赤","赤","無","無","肌","肌","肌",
    "無","無","無","無","無","赤","赤","赤","赤","赤","赤","赤","赤","赤","肌","肌",
    "無","無","無","無","無","茶","茶","茶","肌","肌","茶","肌","無","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","肌","肌","肌","茶","肌","肌","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","茶","肌","肌","肌","茶","肌","肌","肌","赤",
    "無","無","無","無","茶","茶","肌","肌","肌","肌","茶","茶","茶","茶","赤","無",
    "無","無","無","無","無","無","肌","肌","肌","肌","肌","肌","肌","赤","無","無",
    "無","無","赤","赤","赤","赤","赤","青","赤","赤","赤","青","赤","無","無","無",
    "無","赤","赤","赤","赤","赤","赤","赤","青","赤","赤","赤","青","無","無","茶",
    "肌","肌","赤","赤","赤","赤","赤","赤","青","青","青","青","青","無","無","茶",
    "肌","肌","肌","無","青","青","赤","青","青","黄","青","青","黄","青","茶","茶",
    "無","肌","無","茶","青","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","無","茶","茶","茶","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","茶","茶","茶","青","青","青","青","青","青","青","無","無","無","無","無",
    "無","茶","無","無","青","青","青","青","無","無","無","無","無","無","無","無"
];

function getRgbColor( c )
{
    var colorHash = {
        "無":"#000000",
        "白":"#ffffff",
        "肌":"#ffcccc",
        "茶":"#800000",
        "赤":"#ff0000",
        "黄":"#ffff00",
        "緑":"#00ff00",
        "水":"#00ffff",
        "青":"#0000ff",
        "紫":"#800080"
    };
    return colorHash[ c ];
}

onload = function() {
    var timer;
    timer = setInterval(draw, 1000 / FPS);
};

function draw() {

    setCell();
    drawCell();

}

function setCell() {
    for (dx = 0; dx < wsize; dx++) {
        world[dx] = new Array();
        for (dy = 0; dy < wsize; dy++) {
            if (Math.random() < initRate) {
                world[dx][dy] = 1;
            }
        }
    }
}

function drawCell() {
    var canvas = document.getElementById('sample');
    if (!canvas || !canvas.getContext) {
        return false;
    }
    var ctx = canvas.getContext('2d');

    for (dx = 0; dx < wsize; dx++) {
        for (dy = 0; dy < wsize; dy++) {
            if (world[dx][dy] === 1) {
                if (dx >= X_START_POS && dx < (X_START_POS + 64) 
                 && dy >= X_START_POS && dy < (Y_START_POS + 64)) {
                    var x = Math.floor((dx - X_START_POS) / 4);
                    var y = Math.floor((dy - Y_START_POS) / 4);
                    var pos = y * 16 + x;
                    if (dataSet[pos] != "無") {
                        ctx.strokeStyle = getRgbColor(dataSet[pos]);
                    } else {
                        ctx.strokeStyle = "#000000";
                    }
                } else {
                    ctx.strokeStyle = "#000000";
                }
                ctx.strokeRect(dx * bsize, dy * bsize, bsize, bsize);
            }
        }
    }
}