// forked from cx20's "p5.js でドット絵を描くテスト" http://jsdo.it/cx20/symj
// forked from cx20's "Processing.js でドット絵を描くテスト" http://jsdo.it/cx20/in7V

var DOT_SIZE = 32;
var X_START_POS = -465/2;
var Y_START_POS = -465/2;
var angle = 0;

// ‥‥‥‥‥‥‥‥‥‥‥‥‥□□□
// ‥‥‥‥‥‥〓〓〓〓〓‥‥□□□
// ‥‥‥‥‥〓〓〓〓〓〓〓〓〓□□
// ‥‥‥‥‥■■■□□■□‥■■■
// ‥‥‥‥■□■□□□■□□■■■
// ‥‥‥‥■□■■□□□■□□□■
// ‥‥‥‥■■□□□□■■■■■‥
// ‥‥‥‥‥‥□□□□□□□■‥‥
// ‥‥■■■■■〓■■■〓■‥‥‥
// ‥■■■■■■■〓■■■〓‥‥■
// □□■■■■■■〓〓〓〓〓‥‥■
// □□□‥〓〓■〓〓□〓〓□〓■■
// ‥□‥■〓〓〓〓〓〓〓〓〓〓■■
// ‥‥■■■〓〓〓〓〓〓〓〓〓■■
// ‥■■■〓〓〓〓〓〓〓‥‥‥‥‥
// ‥■‥‥〓〓〓〓‥‥‥‥‥‥‥‥
var dataSet = [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","肌","肌","肌",
    "無","無","無","無","無","無","赤","赤","赤","赤","赤","無","無","肌","肌","肌",
    "無","無","無","無","無","赤","赤","赤","赤","赤","赤","赤","赤","赤","肌","肌",
    "無","無","無","無","無","茶","茶","茶","肌","肌","茶","肌","無","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","肌","肌","肌","茶","肌","肌","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","茶","肌","肌","肌","茶","肌","肌","肌","赤",
    "無","無","無","無","茶","茶","肌","肌","肌","肌","茶","茶","茶","茶","赤","無",
    "無","無","無","無","無","無","肌","肌","肌","肌","肌","肌","肌","赤","無","無",
    "無","無","赤","赤","赤","赤","赤","青","赤","赤","赤","青","赤","無","無","無",
    "無","赤","赤","赤","赤","赤","赤","赤","青","赤","赤","赤","青","無","無","茶",
    "肌","肌","赤","赤","赤","赤","赤","赤","青","青","青","青","青","無","無","茶",
    "肌","肌","肌","無","青","青","赤","青","青","黄","青","青","黄","青","茶","茶",
    "無","肌","無","茶","青","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","無","茶","茶","茶","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","茶","茶","茶","青","青","青","青","青","青","青","無","無","無","無","無",
    "無","茶","無","無","青","青","青","青","無","無","無","無","無","無","無","無"
];

function getRgbColor( c )
{
    var colorHash = {
        "無":[0x00, 0x00, 0x00],
        "白":[0xff, 0xff, 0xff],
        "肌":[0xff, 0xcc, 0xcc],
        "茶":[0x80, 0x00, 0x00],
        "赤":[0xff, 0x00, 0x00],
        "黄":[0xff, 0xff, 0x00],
        "緑":[0x00, 0xff, 0x00],
        "水":[0x00, 0xff, 0xff],
        "青":[0x00, 0x00, 0xff],
        "紫":[0x80, 0x00, 0x80]
    };
    return colorHash[ c ];
}

function setup(){
    createCanvas(465, 465, WEBGL);
}

function draw(){
    angle += Math.PI / 180;
    background(0);
    ambientLight(255, 255, 255);
    directionalLight(100, -100, -200, 0.25, 0.25, 0.25);
    var i, x, y;
    for (i = 0; i < dataSet.length; i++) {
        var x = (i % 16) * DOT_SIZE;
        var y = Math.floor(i / 16) * DOT_SIZE;
        if (dataSet[i] != "無") {
            push();
            var c = getRgbColor(dataSet[i]);
            specularMaterial(c[0], c[1], c[2]);
            translate(X_START_POS + x, Y_START_POS + y, 0);
            rotate(angle, [1, 1, 1]);
            box(DOT_SIZE * 0.35);
            pop();
        }
    }
}