 //Load Bonsai
bonsai.run(document.getElementById('movie'), {
    code: function() {
        var DOT_SIZE = 10;
        // ‥‥‥‥‥‥‥‥‥‥‥‥‥□□□
        // ‥‥‥‥‥‥〓〓〓〓〓‥‥□□□
        // ‥‥‥‥‥〓〓〓〓〓〓〓〓〓□□
        // ‥‥‥‥‥■■■□□■□‥■■■
        // ‥‥‥‥■□■□□□■□□■■■
        // ‥‥‥‥■□■■□□□■□□□■
        // ‥‥‥‥■■□□□□■■■■■‥
        // ‥‥‥‥‥‥□□□□□□□■‥‥
        // ‥‥■■■■■〓■■■〓■‥‥‥
        // ‥■■■■■■■〓■■■〓‥‥■
        // □□■■■■■■〓〓〓〓〓‥‥■
        // □□□‥〓〓■〓〓□〓〓□〓■■
        // ‥□‥■〓〓〓〓〓〓〓〓〓〓■■
        // ‥‥■■■〓〓〓〓〓〓〓〓〓■■
        // ‥■■■〓〓〓〓〓〓〓‥‥‥‥‥
        // ‥■‥‥〓〓〓〓‥‥‥‥‥‥‥‥

        var dataSet = [
            "無","無","無","無","無","無","無","無","無","無","無","無","無","肌","肌","肌",
            "無","無","無","無","無","無","赤","赤","赤","赤","赤","無","無","肌","肌","肌",
            "無","無","無","無","無","赤","赤","赤","赤","赤","赤","赤","赤","赤","肌","肌",
            "無","無","無","無","無","茶","茶","茶","肌","肌","茶","肌","無","赤","赤","赤",
            "無","無","無","無","茶","肌","茶","肌","肌","肌","茶","肌","肌","赤","赤","赤",
            "無","無","無","無","茶","肌","茶","茶","肌","肌","肌","茶","肌","肌","肌","赤",
            "無","無","無","無","茶","茶","肌","肌","肌","肌","茶","茶","茶","茶","赤","無",
            "無","無","無","無","無","無","肌","肌","肌","肌","肌","肌","肌","赤","無","無",
            "無","無","赤","赤","赤","赤","赤","青","赤","赤","赤","青","赤","無","無","無",
            "無","赤","赤","赤","赤","赤","赤","赤","青","赤","赤","赤","青","無","無","茶",
            "肌","肌","赤","赤","赤","赤","赤","赤","青","青","青","青","青","無","無","茶",
            "肌","肌","肌","無","青","青","赤","青","青","黄","青","青","黄","青","茶","茶",
            "無","肌","無","茶","青","青","青","青","青","青","青","青","青","青","茶","茶",
            "無","無","茶","茶","茶","青","青","青","青","青","青","青","青","青","茶","茶",
            "無","茶","茶","茶","青","青","青","青","青","青","青","無","無","無","無","無",
            "無","茶","無","無","青","青","青","青","無","無","無","無","無","無","無","無"
        ];

        function getRgbColor( c )
        {
            var colorHash = {
                "無":"#000000",
                "白":"#ffffff",
                "肌":"#ffcccc",
                "茶":"#800000",
                "赤":"#ff0000",
                "黄":"#ffff00",
                "緑":"#00ff00",
                "水":"#00ffff",
                "青":"#0000ff",
                "紫":"#800080"
            };
            return colorHash[ c ];
        }

        function draw() {
            var x, y;
            var color;
            for (var i = 0; i < dataSet.length; i++) {
                x = (i % 16) * DOT_SIZE;
                y = Math.floor(i / 16) * DOT_SIZE;
                color = getRgbColor(dataSet[i]);
                if (dataSet[i] != "無") {
                    new Rect(x, y, DOT_SIZE * 0.8, DOT_SIZE * 0.8).fill(color).addTo(container);
                }
            }
        }

        function anim() {
            // Move the container to random locations
            container.animate('1s', {
                x: Math.random() * 300,
                y: Math.random() * 300
            }, {
                onEnd: anim,
                easing: 'elasticInOut'
            });
        }
        
        var container = new Group().addTo(stage);
        draw();
        anim();
    },
    width: 450,
    height: 450
});
