// forked from cx20's "Processing.js でドット絵を描くテスト" http://jsdo.it/cx20/in7V

var DOT_SIZE = 16;
var X_START_POS = 0;
var Y_START_POS = 0;

// ‥‥‥‥‥‥‥‥‥‥‥‥‥□□□
// ‥‥‥‥‥‥〓〓〓〓〓‥‥□□□
// ‥‥‥‥‥〓〓〓〓〓〓〓〓〓□□
// ‥‥‥‥‥■■■□□■□‥■■■
// ‥‥‥‥■□■□□□■□□■■■
// ‥‥‥‥■□■■□□□■□□□■
// ‥‥‥‥■■□□□□■■■■■‥
// ‥‥‥‥‥‥□□□□□□□■‥‥
// ‥‥■■■■■〓■■■〓■‥‥‥
// ‥■■■■■■■〓■■■〓‥‥■
// □□■■■■■■〓〓〓〓〓‥‥■
// □□□‥〓〓■〓〓□〓〓□〓■■
// ‥□‥■〓〓〓〓〓〓〓〓〓〓■■
// ‥‥■■■〓〓〓〓〓〓〓〓〓■■
// ‥■■■〓〓〓〓〓〓〓‥‥‥‥‥
// ‥■‥‥〓〓〓〓‥‥‥‥‥‥‥‥
var dataSet = [
    "無","無","無","無","無","無","無","無","無","無","無","無","無","肌","肌","肌",
    "無","無","無","無","無","無","赤","赤","赤","赤","赤","無","無","肌","肌","肌",
    "無","無","無","無","無","赤","赤","赤","赤","赤","赤","赤","赤","赤","肌","肌",
    "無","無","無","無","無","茶","茶","茶","肌","肌","茶","肌","無","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","肌","肌","肌","茶","肌","肌","赤","赤","赤",
    "無","無","無","無","茶","肌","茶","茶","肌","肌","肌","茶","肌","肌","肌","赤",
    "無","無","無","無","茶","茶","肌","肌","肌","肌","茶","茶","茶","茶","赤","無",
    "無","無","無","無","無","無","肌","肌","肌","肌","肌","肌","肌","赤","無","無",
    "無","無","赤","赤","赤","赤","赤","青","赤","赤","赤","青","赤","無","無","無",
    "無","赤","赤","赤","赤","赤","赤","赤","青","赤","赤","赤","青","無","無","茶",
    "肌","肌","赤","赤","赤","赤","赤","赤","青","青","青","青","青","無","無","茶",
    "肌","肌","肌","無","青","青","赤","青","青","黄","青","青","黄","青","茶","茶",
    "無","肌","無","茶","青","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","無","茶","茶","茶","青","青","青","青","青","青","青","青","青","茶","茶",
    "無","茶","茶","茶","青","青","青","青","青","青","青","無","無","無","無","無",
    "無","茶","無","無","青","青","青","青","無","無","無","無","無","無","無","無"
];

function getRgbColor( c )
{
	var colorHash = {
		"無":[0x00, 0x00, 0x00],
		"白":[0xff, 0xff, 0xff],
		"肌":[0xff, 0xcc, 0xcc],
		"茶":[0x80, 0x00, 0x00],
		"赤":[0xff, 0x00, 0x00],
		"黄":[0xff, 0xff, 0x00],
		"緑":[0x00, 0xff, 0x00],
		"水":[0x00, 0xff, 0xff],
		"青":[0x00, 0x00, 0xff],
		"紫":[0x80, 0x00, 0x80]
	};
	return colorHash[ c ];
}

var screenWidth = 465;
var screenHeight = 465;
var mario = [];

function setup() {
    createCanvas(screenWidth, screenHeight);
    background( 0 );
    noStroke();

    for (var i = 0; i < 10; i++) {
        mario.push(new Mario());
    }
}

function draw() {
    background(0);
    for (var i = 0; i < mario.length; i++) {
        mario[i].update();
    }
}

var Mario = function() {
    this.base_x = random(screenWidth);
    this.base_y = random(screenHeight);
    this.radius = (random(120) + 60) / 16;
    this.speed = random(5) + 5;
};

Mario.prototype.update = function() {
    this.base_y -= this.speed;
    if (this.base_y + this.radius <= 0) {
        this.base_y = screenHeight + this.radius * 2;
    }

    var i, x, y;
    for (i = 0; i < dataSet.length; i++) {
        var x = (i % 16) * this.radius;
        var y = Math.floor(i / 16) * this.radius;
        if (dataSet[i] != "無") {
            var c = color(getRgbColor(dataSet[i]));
            fill(c);
            rect(this.base_x + x, this.base_y + y, this.radius - 2, this.radius - 2);
        }
    }
};